tests/ycsb/results/bw_bench_20260417_001923/phase2_hotspot.txt
/usr/bin/java  -classpath /tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-8079/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=32 -p redis.host=127.0.0.1 -p redis.port=6379
Command line: -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-8079/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=32 -p redis.host=127.0.0.1 -p redis.port=6379
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-04-17 00:22:18:090 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-17 00:22:27:983 10 sec: 82375 operations; 8236.68 current ops/sec; est completion in 3 minutes [READ: Count=30127, Max=177407, Min=49, Avg=3293.55, 90=5187, 99=13711, 99.9=42303, 99.99=163967] [UPDATE: Count=16640, Max=177407, Min=296, Avg=3836.94, 90=6115, 99=15519, 99.9=44159, 99.99=175743] [READ-FAILED: Count=27638, Max=177663, Min=35, Avg=3309.79, 90=5275, 99=13399, 99.9=47807, 99.99=171647] [INSERT: Count=8224, Max=155007, Min=344, Avg=7020.47, 90=11391, 99=27551, 99.9=65183, 99.99=79935] 
2026-04-17 00:22:37:982 20 sec: 167898 operations; 8553.16 current ops/sec; est completion in 3 minutes [READ: Count=33257, Max=105087, Min=53, Avg=3305.57, 90=4975, 99=12935, 99.9=41183, 99.99=69247] [UPDATE: Count=17161, Max=105279, Min=303, Avg=3712.79, 90=5515, 99=14143, 99.9=41375, 99.99=70335] [READ-FAILED: Count=26647, Max=105151, Min=40, Avg=3219.74, 90=4819, 99=12431, 99.9=40191, 99.99=69055] [INSERT: Count=8518, Max=108415, Min=475, Avg=6924.59, 90=10007, 99=25551, 99.9=48895, 99.99=73471] 
2026-04-17 00:22:47:983 30 sec: 259848 operations; 9195 current ops/sec; est completion in 3 minutes [READ: Count=36603, Max=71743, Min=93, Avg=3074.1, 90=4515, 99=12847, 99.9=39327, 99.99=71167] [UPDATE: Count=18245, Max=75839, Min=335, Avg=3469.47, 90=5007, 99=14591, 99.9=40575, 99.99=75007] [READ-FAILED: Count=27825, Max=71999, Min=69, Avg=3006.76, 90=4467, 99=11959, 99.9=39231, 99.99=70911] [INSERT: Count=9043, Max=79551, Min=761, Avg=6563.88, 90=9439, 99=26047, 99.9=47775, 99.99=78655] 
2026-04-17 00:22:57:986 40 sec: 350890 operations; 9103.29 current ops/sec; est completion in 3 minutes [READ: Count=36532, Max=76287, Min=67, Avg=3094.28, 90=4507, 99=12639, 99.9=50879, 99.99=71295] [UPDATE: Count=18344, Max=75135, Min=331, Avg=3501.67, 90=4911, 99=14071, 99.9=53887, 99.99=72319] [READ-FAILED: Count=27189, Max=72255, Min=40, Avg=3016.09, 90=4403, 99=11983, 99.9=42943, 99.99=71103] [INSERT: Count=9039, Max=81407, Min=332, Avg=6599.3, 90=9255, 99=29967, 99.9=66623, 99.99=81407] 
2026-04-17 00:23:07:983 50 sec: 441243 operations; 9036.2 current ops/sec; est completion in 2 minutes [READ: Count=36455, Max=79231, Min=107, Avg=3148.34, 90=4627, 99=12879, 99.9=66111, 99.99=76863] [UPDATE: Count=18141, Max=79423, Min=272, Avg=3531.22, 90=5035, 99=13751, 99.9=69311, 99.99=78783] [READ-FAILED: Count=26579, Max=78015, Min=79, Avg=3053.09, 90=4555, 99=11663, 99.9=41247, 99.99=76479] [INSERT: Count=9168, Max=84095, Min=546, Avg=6462.46, 90=9087, 99=23135, 99.9=70655, 99.99=83519] 
2026-04-17 00:23:17:982 60 sec: 530568 operations; 8932.5 current ops/sec; est completion in 2 minutes [READ: Count=36250, Max=135807, Min=152, Avg=3123.05, 90=4507, 99=12407, 99.9=38975, 99.99=122687] [UPDATE: Count=17986, Max=136575, Min=289, Avg=3519.05, 90=5031, 99=14031, 99.9=43007, 99.99=87039] [READ-FAILED: Count=25985, Max=136319, Min=75, Avg=3143.97, 90=4527, 99=12503, 99.9=57791, 99.99=123775] [INSERT: Count=9055, Max=140927, Min=1618, Avg=6715.09, 90=9031, 99=27791, 99.9=91775, 99.99=138111] 
2026-04-17 00:23:27:984 70 sec: 618941 operations; 8837.3 current ops/sec; est completion in 2 minutes [READ: Count=36452, Max=102271, Min=86, Avg=3192.88, 90=4747, 99=15039, 99.9=61279, 99.99=100031] [UPDATE: Count=17641, Max=101503, Min=263, Avg=3558.5, 90=5339, 99=16655, 99.9=49791, 99.99=98495] [READ-FAILED: Count=25650, Max=98943, Min=50, Avg=3179.52, 90=4727, 99=15999, 99.9=59935, 99.99=96831] [INSERT: Count=8643, Max=104447, Min=545, Avg=6791.94, 90=10111, 99=32575, 99.9=64351, 99.99=100863] 
2026-04-17 00:23:37:982 80 sec: 710569 operations; 9162.8 current ops/sec; est completion in 2 minutes [READ: Count=37822, Max=67007, Min=51, Avg=3076.57, 90=4607, 99=11175, 99.9=38943, 99.99=66303] [UPDATE: Count=18389, Max=66431, Min=219, Avg=3430.11, 90=5019, 99=12087, 99.9=38943, 99.99=66047] [READ-FAILED: Count=26251, Max=68351, Min=34, Avg=3052.46, 90=4551, 99=11503, 99.9=38911, 99.99=66431] [INSERT: Count=9162, Max=70527, Min=325, Avg=6493.51, 90=9543, 99=21247, 99.9=43455, 99.99=70143] 
2026-04-17 00:23:47:982 90 sec: 797476 operations; 8690.7 current ops/sec; est completion in 2 minutes [READ: Count=35996, Max=108735, Min=76, Avg=3248.12, 90=4819, 99=12567, 99.9=43423, 99.99=93951] [UPDATE: Count=17268, Max=108863, Min=279, Avg=3618.06, 90=5279, 99=14247, 99.9=43871, 99.99=93759] [READ-FAILED: Count=24888, Max=108095, Min=61, Avg=3223.5, 90=4771, 99=12959, 99.9=41247, 99.99=94655] [INSERT: Count=8713, Max=124479, Min=673, Avg=6849.87, 90=9575, 99=25183, 99.9=91327, 99.99=123647] 
2026-04-17 00:23:57:982 100 sec: 888192 operations; 9071.6 current ops/sec; est completion in 2 minutes [READ: Count=37596, Max=55423, Min=110, Avg=3108.36, 90=4527, 99=12455, 99.9=41535, 99.99=47679] [UPDATE: Count=18233, Max=53951, Min=482, Avg=3485.47, 90=4943, 99=13575, 99.9=41375, 99.99=50431] [READ-FAILED: Count=25880, Max=60959, Min=46, Avg=3094.54, 90=4507, 99=12759, 99.9=42367, 99.99=48351] [INSERT: Count=9011, Max=64479, Min=908, Avg=6530.01, 90=8783, 99=24703, 99.9=50527, 99.99=63935] 
2026-04-17 00:24:07:982 110 sec: 978828 operations; 9063.6 current ops/sec; est completion in 1 minute [READ: Count=37715, Max=62687, Min=126, Avg=3147.68, 90=4551, 99=12855, 99.9=39871, 99.99=60959] [UPDATE: Count=18203, Max=62815, Min=324, Avg=3446.66, 90=4895, 99=12583, 99.9=30383, 99.99=60159] [READ-FAILED: Count=25716, Max=62751, Min=70, Avg=3065.28, 90=4479, 99=11583, 99.9=38847, 99.99=60095] [INSERT: Count=8995, Max=65023, Min=1603, Avg=6567.08, 90=8615, 99=25359, 99.9=48063, 99.99=64607] 
2026-04-17 00:24:17:982 120 sec: 1072641 operations; 9380.36 current ops/sec; est completion in 1 minute [READ: Count=39574, Max=48159, Min=50, Avg=3000.24, 90=4347, 99=12343, 99.9=39807, 99.99=44831] [UPDATE: Count=18532, Max=47999, Min=202, Avg=3370.61, 90=4803, 99=13415, 99.9=40479, 99.99=47519] [READ-FAILED: Count=26292, Max=47647, Min=39, Avg=2959.89, 90=4275, 99=12207, 99.9=41631, 99.99=47423] [INSERT: Count=9434, Max=53727, Min=507, Avg=6398.83, 90=8967, 99=26079, 99.9=47519, 99.99=50623] 
2026-04-17 00:24:27:982 130 sec: 1165847 operations; 9321.53 current ops/sec; est completion in 1 minute [READ: Count=39281, Max=63935, Min=85, Avg=3026.68, 90=4447, 99=11199, 99.9=39199, 99.99=59807] [UPDATE: Count=18818, Max=65311, Min=262, Avg=3446.37, 90=4947, 99=12999, 99.9=40671, 99.99=55199] [READ-FAILED: Count=26007, Max=66559, Min=148, Avg=2974.55, 90=4411, 99=10623, 99.9=38975, 99.99=55391] [INSERT: Count=9073, Max=79615, Min=805, Avg=6420.36, 90=9103, 99=24063, 99.9=45983, 99.99=73023] 
2026-04-17 00:24:37:982 140 sec: 1260691 operations; 9484.4 current ops/sec; est completion in 1 minute [READ: Count=39604, Max=52767, Min=49, Avg=2959.1, 90=4351, 99=10799, 99.9=40799, 99.99=46751] [UPDATE: Count=18726, Max=52575, Min=339, Avg=3356.01, 90=4783, 99=12623, 99.9=42367, 99.99=46687] [READ-FAILED: Count=26859, Max=53343, Min=62, Avg=2892.72, 90=4299, 99=10799, 99.9=39871, 99.99=46399] [INSERT: Count=9655, Max=53407, Min=347, Avg=6375.58, 90=8951, 99=22511, 99.9=48671, 99.99=53311] 
2026-04-17 00:24:47:982 150 sec: 1349158 operations; 8846.7 current ops/sec; est completion in 1 minute [READ: Count=37257, Max=237567, Min=72, Avg=3224.7, 90=4615, 99=14159, 99.9=42175, 99.99=237055] [UPDATE: Count=17694, Max=237695, Min=274, Avg=3571.26, 90=5163, 99=15407, 99.9=41951, 99.99=54463] [READ-FAILED: Count=24607, Max=237567, Min=57, Avg=3115.66, 90=4507, 99=13167, 99.9=41247, 99.99=237311] [INSERT: Count=8963, Max=247679, Min=478, Avg=6637.06, 90=9447, 99=24895, 99.9=47039, 99.99=241535] 
2026-04-17 00:24:57:982 160 sec: 1437003 operations; 8784.5 current ops/sec; est completion in 1 minute [READ: Count=36874, Max=59359, Min=127, Avg=3213.47, 90=4975, 99=11703, 99.9=29295, 99.99=52767] [UPDATE: Count=17682, Max=57727, Min=230, Avg=3587.13, 90=5459, 99=12927, 99.9=29887, 99.99=53759] [READ-FAILED: Count=24531, Max=63999, Min=56, Avg=3179.66, 90=4895, 99=11775, 99.9=30287, 99.99=57727] [INSERT: Count=8724, Max=66047, Min=1384, Avg=6807.86, 90=10215, 99=24319, 99.9=56575, 99.99=64223] 
2026-04-17 00:25:07:982 170 sec: 1527804 operations; 9080.1 current ops/sec; est completion in 53 seconds [READ: Count=38207, Max=53727, Min=64, Avg=3111.64, 90=4583, 99=12031, 99.9=41535, 99.99=51199] [UPDATE: Count=18133, Max=52703, Min=379, Avg=3487.5, 90=4999, 99=13247, 99.9=42335, 99.99=50879] [READ-FAILED: Count=25368, Max=53983, Min=55, Avg=3054.76, 90=4515, 99=11543, 99.9=40543, 99.99=50783] [INSERT: Count=9074, Max=82303, Min=923, Avg=6584.88, 90=9159, 99=24271, 99.9=50623, 99.99=61087] 
2026-04-17 00:25:17:982 180 sec: 1613648 operations; 8584.4 current ops/sec; est completion in 44 seconds [READ: Count=35790, Max=53663, Min=214, Avg=3304.7, 90=5103, 99=11895, 99.9=40767, 99.99=47903] [UPDATE: Count=17354, Max=53183, Min=536, Avg=3641.5, 90=5523, 99=12527, 99.9=40191, 99.99=47455] [READ-FAILED: Count=24081, Max=53471, Min=276, Avg=3234.22, 90=5031, 99=11527, 99.9=40255, 99.99=53151] [INSERT: Count=8637, Max=57919, Min=1353, Avg=6957.99, 90=10207, 99=24431, 99.9=51199, 99.99=57791] 
2026-04-17 00:25:27:982 190 sec: 1703924 operations; 9027.6 current ops/sec; est completion in 34 seconds [READ: Count=37533, Max=59519, Min=61, Avg=3107.99, 90=4627, 99=12071, 99.9=41823, 99.99=55807] [UPDATE: Count=18173, Max=58943, Min=235, Avg=3539.75, 90=5059, 99=13807, 99.9=42943, 99.99=56479] [READ-FAILED: Count=25513, Max=59103, Min=38, Avg=3068.06, 90=4579, 99=11887, 99.9=41631, 99.99=55999] [INSERT: Count=9065, Max=64415, Min=530, Avg=6631.2, 90=9215, 99=25647, 99.9=57279, 99.99=61631] 
2026-04-17 00:25:37:983 200 sec: 1799221 operations; 9529.7 current ops/sec; est completion in 23 seconds [READ: Count=39785, Max=55071, Min=50, Avg=2958.51, 90=4347, 99=10775, 99.9=39423, 99.99=52287] [UPDATE: Count=19209, Max=54911, Min=270, Avg=3327.48, 90=4755, 99=11495, 99.9=42111, 99.99=54815] [READ-FAILED: Count=26686, Max=55103, Min=36, Avg=2910.14, 90=4335, 99=10151, 99.9=39391, 99.99=52127] [INSERT: Count=9609, Max=59679, Min=375, Avg=6247.94, 90=8879, 99=19023, 99.9=46719, 99.99=59519] 
2026-04-17 00:25:47:982 210 sec: 1894361 operations; 9514 current ops/sec; est completion in 12 seconds [READ: Count=39489, Max=59679, Min=50, Avg=2947.85, 90=4275, 99=11103, 99.9=40703, 99.99=47455] [UPDATE: Count=18930, Max=59807, Min=272, Avg=3317.19, 90=4651, 99=12879, 99.9=41599, 99.99=58335] [READ-FAILED: Count=27187, Max=61919, Min=36, Avg=2909.15, 90=4183, 99=11647, 99.9=40991, 99.99=58783] [INSERT: Count=9476, Max=68735, Min=549, Avg=6339.3, 90=8759, 99=26607, 99.9=50463, 99.99=68479] 
2026-04-17 00:25:57:983 220 sec: 1982967 operations; 8859.71 current ops/sec; est completion in 2 second [READ: Count=36982, Max=68543, Min=94, Avg=3186.33, 90=4587, 99=11279, 99.9=44063, 99.99=60895] [CLEANUP: Count=2, Max=4619, Min=175, Avg=2396.5, 90=4619, 99=4619, 99.9=4619, 99.99=4619] [UPDATE: Count=17590, Max=67263, Min=325, Avg=3497.04, 90=5059, 99=11855, 99.9=43935, 99.99=61759] [READ-FAILED: Count=25162, Max=69311, Min=85, Avg=3171.55, 90=4583, 99=11263, 99.9=46079, 99.99=67647] [INSERT: Count=8952, Max=80447, Min=1401, Avg=6728.68, 90=9135, 99=23887, 99.9=66943, 99.99=79679] 
2026-04-17 00:26:00:041 222 sec: 2000000 operations; 8276.48 current ops/sec; [READ: Count=7084, Max=46367, Min=58, Avg=2319.07, 90=3663, 99=9503, 99.9=42847, 99.99=43519] [CLEANUP: Count=30, Max=669, Min=133, Avg=263.73, 90=346, 99=669, 99.9=669, 99.99=669] [UPDATE: Count=3462, Max=47167, Min=174, Avg=2697.85, 90=4167, 99=12735, 99.9=45759, 99.99=47167] [READ-FAILED: Count=4832, Max=46271, Min=41, Avg=2327.71, 90=3763, 99=10607, 99.9=42911, 99.99=46271] [INSERT: Count=1575, Max=52767, Min=329, Avg=5176.53, 90=7763, 99=28367, 99.9=48191, 99.99=52767] 
[OVERALL], RunTime(ms), 222059
[OVERALL], Throughput(ops/sec), 9006.615358981171
[TOTAL_GCS_G1_Young_Generation], Count, 291
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1029
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4633903602195813
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 291
[TOTAL_GC_TIME], Time(ms), 1029
[TOTAL_GC_TIME_%], Time(%), 0.4633903602195813
[READ], Operations, 822265
[READ], AverageLatency(us), 3117.715630605705
[READ], MinLatency(us), 49
[READ], MaxLatency(us), 237567
[READ], 95thPercentileLatency(us), 6251
[READ], 99thPercentileLatency(us), 12175
[READ], Return=OK, 822265
[READ], Return=ERROR, 577373
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 397.03125
[CLEANUP], MinLatency(us), 133
[CLEANUP], MaxLatency(us), 4619
[CLEANUP], 95thPercentileLatency(us), 379
[CLEANUP], 99thPercentileLatency(us), 4619
[UPDATE], Operations, 400554
[UPDATE], AverageLatency(us), 3500.589216435237
[UPDATE], MinLatency(us), 174
[UPDATE], MaxLatency(us), 237695
[UPDATE], 95thPercentileLatency(us), 6947
[UPDATE], 99thPercentileLatency(us), 13487
[UPDATE], Return=OK, 400554
[READ-FAILED], Operations, 577373
[READ-FAILED], AverageLatency(us), 3075.316452276085
[READ-FAILED], MinLatency(us), 34
[READ-FAILED], MaxLatency(us), 237567
[READ-FAILED], 95thPercentileLatency(us), 6203
[READ-FAILED], 99thPercentileLatency(us), 11999
[INSERT], Operations, 199808
[INSERT], AverageLatency(us), 6601.7509759368995
[INSERT], MinLatency(us), 325
[INSERT], MaxLatency(us), 247679
[INSERT], 95thPercentileLatency(us), 12527
[INSERT], 99thPercentileLatency(us), 25055
[INSERT], Return=OK, 199808